# Resumo Prova Intermediária

## `SELECT`

Mostrar tudo da tabela exemplo CD:

<div class="alert alert-info">

```mysql
SELECT * FROM CD
```

</div>

![Seleção da tabela inteira](../aulas/02-select_parte1/imgs/tudo.png)

Mostrando apenas algumas colunas:

<div class="alert alert-info">

```mysql
SELECT Nome_CD, Data_Lancamento FROM CD
```

</div>

![Seleção da tabela em partes](../aulas/02-select_parte1/imgs/projecao.png)

Mostrar algumas linhas escolhidas:

<div class="alert alert-info">

```mysql
SELECT 
    *
FROM
    CD
WHERE
    Nome_CD LIKE '%a'
```

</div>

![Seleção da tabela inteira](../aulas/02-select_parte1/imgs/selecao.png)

## `WHERE`

Filtrar as linhas da tabela através da especificação de condições -> o resultado será um subconjunto das linhas da tabela onde a condição é verdadeira.

Exemplo: Mostrar todos os CDs que custam mais de 13 reais.

<div class="alert alert-info">

```mysql
SELECT 
    Nome_CD,
    Preco_Venda,
    Data_Lancamento
FROM 
    CD 
WHERE 
    Preco_Venda >= 13 
```

</div>

### `WHERE != HAVING`

#### WHERE

- Filtrar antes de qualquer tipo de agrupamento
- Aplicada diretamente nas linhas da tabela
- Não pode ser usada com funções de agregação

#### HAVING

- Filtrar após a agregação (`GROUP BY`)
- Aplicada nas linhas resultantes da agregação
- Só pode ser usada com funções de agregação

## DDL

### Data Definition Language

**`SQL`** para criação de tabelas e relacionamentos em uma base de dados.

#### Criação da base de dados
```sql
DROP SCHEMA IF EXISTS nome do banco;
CREATE SCHEMA IF NOT EXISTS nome do banco;
USE nome do banco;
```

#### Criação de tabelas

Exemplo: Tabela de usuários<br>
**usuario(id_usuario, nome, nickname, data_cadastro, ativo)**

```sql
DROP TABLE IF EXISTS usuario;
CREATE TABLE IF NOT EXISTS usuario(
	id_usuario INT NOT NULL,
    nome VARCHAR(100) NOT NULL,
    nickname VARCHAR(30) NOT NULL,
    data_cadastro DATETIME NOT NULL,
    ativo TINYINT NOT NULL,
    PRIMARY KEY (id_usuario)
);
```

## DML

### Data Manipulation Language

`SQL` para manipulação de dados em uma base de dados.

### Inserção de dados

Estrutura básica:
    
```sql
INSERT INTO nome_tabela (coluna1, coluna2, coluna3, ...)
VALUES (valor1, valor2, valor3, ...);
```

Exemplo:

Inserção simples
```sql
INSERT INTO Funcionarios (ID, Nome, Cargo)
VALUES (1, 'João Silva', 'Desenvolvedor');
```

Inserção de múltiplos registros
```sql
INSERT INTO Funcionarios (ID, Nome, Cargo)
VALUES 
    (1, 'João Silva', 'Desenvolvedor'),
    (2, 'Maria Oliveira', 'Analista de Sistemas'),
    (3, 'Carlos Pereira', 'Gerente de TI');
```

### Atualização de dados

Estrutura básica:
    
```sql
UPDATE nome_tabela
SET coluna1 = valor1, coluna2 = valor2, ...
WHERE condição;
```

Exemplos:

```sql
UPDATE Funcionarios
SET Cargo = 'Analista de Sistemas'
WHERE ID = 1;
```

```sql
UPDATE Funcionarios
SET Cargo = 'Gerente de Projetos', Salario = 7500
WHERE ID = 1;
```

```sql
UPDATE Funcionarios
SET Salario = Salario * 1.10
WHERE Cargo = 'Desenvolvedor';
```

### Exclusão de dados

Estrutura básica:
    
```sql
DELETE FROM nome_tabela
WHERE condição;
```

Exemplos:

```sql
DELETE FROM Funcionarios
WHERE ID = 1;
```

```sql
DELETE FROM Funcionarios
WHERE Cargo = 'Estagiário';
```

```sql
DELETE FROM Funcionarios;
WHERE Salario < 2000;
```

### `REPLACE` = `DELETE` + `INSERT`

- **Tentativa de Atualização:** O `REPLACE` primeiro tenta atualizar um registro existente. Se um registro com a chave especificada já existe, os valores das outras colunas são atualizados.

- **Deleção e Inserção:** Se a atualização falha devido a uma violação de chave (primária ou única), o comando deleta o registro existente que está causando a violação e então insere o novo registro como uma nova entrada.

Exemplos:

```sql
REPLACE INTO Pessoas (ID, Nome, Idade)
VALUES (1, 'Maria', 30);
```

Se já existir uma pessoa com ID = 1, essa entrada será substituída pela nova entrada (Nome = 'Maria', Idade = 30). Se não, a nova entrada será simplesmente inserida na tabela.
<br><br>

```sql
UPDATE
    alunos
SET
    endereco1 = REPLACE(endereco1, "Avenida Marginal", "Avenida Ribeirinha")
WHERE
    endereco1 LIKE "Avenida Marginal%"
    AND endereco1 LIKE "%Anapólis%"
```

Substitui "Avenida Marginal" por "Avenida Ribeirinha" no endereço dos alunos que moram em Anapólis e cujo endereço começa com "Avenida Marginal".

## Variáveis

Exemplo de declaração de variável:

```sql
SELECT MAX(duracao) INTO @max_duracao from MUSICA
```

A variável `@max_duracao` armazenará o valor máximo da coluna `duracao` da tabela `MUSICA`.

<br>

Para exibir o valor da variável, basta fazer:

```sql
SELECT @max_duracao
```

<br>

É possível utilizar a variável em outras consultas:

```sql
SELECT Nome_musica FROM MUSICA WHERE duracao=@max_duracao
```

Aqui, a consulta retornará o nome da música cuja duração é igual ao valor armazenado na variável `@max_duracao`.

## Agrupamento

### Join (Inner Join)

Consiste em combinar linhas de duas ou mais tabelas com base em uma coluna relacionada entre elas.

É retornado apenas o que tem correspondência nas duas tabelas, ou seja, a interseção entre elas.


```sql
SELECT 
    CD.Nome_CD,
    CD.Preco_Venda,
    CD.Data_Lancamento,
    Artista.Nome_Artista
FROM
    CD
INNER JOIN Artista ON CD.ID_Artista = Artista.ID_Artista
```

Neste caso, a consulta retorna o nome do CD, o preço de venda, a data de lançamento e o nome do artista de cada CD. O nome do artista é obtido através do `JOIN` com a tabela `Artista`, onde o `ID_Artista` do CD é igual ao `ID_Artista` do artista.

### Left Join

Retorna todas as linhas da tabela à esquerda e as linhas correspondentes da tabela à direita. Se não houver correspondência, o resultado é `NULL` na coluna da tabela à direita.

```sql
SELECT 
    CD.Nome_CD,
    CD.Preco_Venda,
    CD.Data_Lancamento,
    Artista.Nome_Artista
FROM
    CD
LEFT JOIN Artista ON CD.ID_Artista = Artista.ID_Artista
```

Neste caso, a consulta retorna o nome do CD, o preço de venda, a data de lançamento e o nome do artista de cada CD. O nome do artista é obtido através do `LEFT JOIN` com a tabela `Artista`, onde o `ID_Artista` do CD é igual ao `ID_Artista` do artista. Se não houver correspondência, o nome do artista será `NULL`.

### Right Join

Retorna todas as linhas da tabela à direita e as linhas correspondentes da tabela à esquerda. Se não houver correspondência, o resultado é `NULL` na coluna da tabela à esquerda.

```sql
SELECT 
    CD.Nome_CD,
    CD.Preco_Venda,
    CD.Data_Lancamento,
    Artista.Nome_Artista
FROM
    CD
RIGHT JOIN Artista ON CD.ID_Artista = Artista.ID_Artista
```

Neste caso, a consulta retorna o nome do CD, o preço de venda, a data de lançamento e o nome do artista de cada CD. O nome do artista é obtido através do `RIGHT JOIN` com a tabela `Artista`, onde o `ID_Artista` do CD é igual ao `ID_Artista` do artista. Se não houver correspondência, o nome do artista será `NULL`.

### Resumo das diferenças entre os tipos de JOIN

- **INNER JOIN:** Retorna linhas quando há ao menos uma correspondência em ambas as tabelas.
- **LEFT JOIN (LEFT OUTER JOIN):** Retorna todas as linhas da tabela da esquerda, e as linhas correspondentes da tabela da direita; linhas sem correspondência da direita têm NULLs.
- **RIGHT JOIN (RIGHT OUTER JOIN):** Retorna todas as linhas da tabela da direita, e as linhas correspondentes da tabela da esquerda; linhas sem correspondência da esquerda têm NULLs.

## Concatenação

```sql
SELECT
    CONCAT('"', c1.Nome_CD, '" indicado por "', c2.Nome_CD, '"') AS indicacao
FROM
    CD c1,
    CD c2
WHERE
    c1.Codigo_CD = c2.CD_Indicado
```

Resultado:
<br>

Executando query:
<br>
('"Perfil" indicado por "Mais do Mesmo"',)
<br>
('"Elis Regina - Essa Mulher" indicado por "Bate-Boca"',)
<br>
('"Mais do Mesmo" indicado por "Elis Regina - Essa Mulher"',)
<br>
('"Mais do Mesmo" indicado por "A Força que nunca Seca"',)
<br>
('"Bate-Boca" indicado por "Perfil"',)
<br>
('"Listen Without Prejudice" indicado por "Barry Manilow Greatest Hits Vol I"',)

## Pipeline do comando SELECT

```
SELECT [DISTINCT] <select_header> 
FROM <source_tables>
WHERE <filter_expression>
GROUP BY <grouping_expressions>
HAVING <filter_expression>
ORDER BY <ordering_expressions>
LIMIT <count> 
OFFSET <count>
```

## Ordem de execução

1. `FROM <source_tables>`: indica as tabelas que serão usadas nesta query e, conceitualmente, combina estas tabelas através de *produto cartesiano* em uma grande tabela. (Note o termo "*conceitualmente*" que usei: em termos de implementação da query este produto cartesiano raramente é construído.)

2. `WHERE <filter_expression>`: filtra linhas.

3. `GROUP BY <grouping_expressions>`: agrupa conjuntos de linhas.

4. `SELECT <select_heading>`: escolha de colunas e de agregados.

5. `HAVING <filter_expression>`: outra filtragem, esta aplicada apenas **depois** da agregação. Pode usar resultados do processo de agregação. Obriga o uso de `GROUP BY`.

6. `DISTINCT`: Elimina linhas duplicadas.

7. `ORDER BY`: ordena as linhas do resultado.

8. `OFFSET <count>`: Pula linhas do resultado. Requer LIMIT.

9. `LIMIT <count>`: Mantém apenas um número máximo de linhas.

## Tabelas temporárias

```sql
DROP TABLE IF EXISTS long_film

CREATE TEMPORARY TABLE long_film 
    SELECT
        *
    FROM
        film
    WHERE
        film.length > 180;
```

## View
Uma *view* é uma tabela virtual, construida a partir de um comando `SELECT`. Por exemplo: execute o código a seguir.

```sql
DROP VIEW IF EXISTS movie_count;

CREATE VIEW movie_count AS
    SELECT 
        title, COUNT(rental_id) as cnt
    FROM
        film
        LEFT OUTER JOIN inventory USING (film_id)
        LEFT OUTER JOIN rental USING (inventory_id)
    GROUP BY
        film_id
    ORDER BY
        cnt ASC;
```